// Умова:
// Дано дійсне число a. З'ясувати, чи належить це число інтервалу
// (3;7) U [8;9) U (11;22.4).

#include <iostream>

using namespace std;

int main() {
    // Оголошення змінної для зберігання введеного дійсного числа
    double a;

    // Введення числа з клавіатури
    cin >> a;

    if ((a > 3.0 && a < 7.0) || (a >= 8.0 && a < 9.0) || (a > 11.0 && a < 22.4)) {
        cout << "Число належить заданому інтервалу" << endl;
    } else {
        cout << "Число НЕ належить заданому інтервалу" << endl;
    }

    return 0; // Успішне завершення програми
}
